app/helpers.php

    function langs()
    {
        $langs = Language::select('name', 'id', 'locale')->orderBy('id', 'DESC')->get();
---
select `name`, `id`, `locale` from `languages` order by `id` desc

    function getMainMenus()
    {
        $locale = App::getLocale();
        $cacheKey = 'main_menus_' . $locale;
        $cachedMenus = Cache::get($cacheKey);

        if ($cachedMenus) {
            return $cachedMenus;
        }

        $menus = Menu::orderBy('order', 'ASC')
            ->byType('main-menu')
            ->active()
            ->parent()
            ->get();
---
select * from `menus` where `menus`.`parent_id` in (26, 27, 28, 29) and `menus`.`deleted_at` is null order by `order` asc

    function isActiveMenu($menu)
    {
        $slug = request('slug');
        $article = Article::where('slug', $slug)->first();
---
select * from `articles` where `slug` = 'board-of-directors' and `articles`.`deleted_at` is null limit 1