app/helpers.php

    function isActiveMenu($menu)
    {
        $slug = request('slug');
        $article = Article::where('slug', $slug)->first();
---
select * from `articles` where `slug` = 'excavation-of-a-group-of-knaytourl-temples' and `articles`.`deleted_at` is null limit 1