app/Http/Controllers/ArticleController.php

    public function index(Request $request)
    {
        $globalSearch = AllowedFilter::callback('global', function ($query, $value) {
            $query->where(function ($query) use ($value) {
                Collection::wrap($value)->each(function ($value) use ($query) {
                    $query
                        ->orWhere('article_contents.name', 'LIKE', "%{$value}%")
                        ->orWhere('category_contents.name', 'LIKE', "%{$value}%");
                });
            });
        });
        $lang = Language::byLocale(App::getLocale())->first();
---
select * from `languages` where `locale` = 'km' limit 1

    public function edit(Article $article)
    {
        $path = "";
        if (Storage::disk('public')->exists($article->thumbnail ?? "") && $article->thumbnail !== null) {
            $path = "/" . $article->thumbnail;
        }
        $theArticle = [
            'id'            => $article->id,
            'category'      => $article->category?->id ?? null,
            'is_active'     => $article->status ? true : false,
            'thumbnail'     => $path
        ];
        $langs = langs();
        foreach ($langs as $lang) {
            $articleContent = ArticleContent::where([
                'article_id' => $article->id,
                'lang_id' => $lang->id
            ])->first();
---
select * from `article_contents` where (`article_id` = 82 and `lang_id` = 2) limit 1

    public function getArticleByCategory($categoryId)
    {
        $articles = Article::byCategory($categoryId)->get();
---
select * from `articles` where `category_id` is null and `articles`.`deleted_at` is null