app/Http/Controllers/CategoryController.php

select * from `categories` where (`parent_id` is null or `parent_id` = 0) and `categories`.`deleted_at` is null
---
    public function getCategory()
    {
        $categories = Category::parent()->get();

select * from `category_contents` where (`category_id` = 4 and `lang_id` = 2) limit 1
---
    public function edit(Category $category)
    {
        $theCategory = [
            'category_id'   => $category->id,
            'is_active'     => $category->status ? true : false,
            'parent'        => $category->id,
            'parent_name'   => $category->name
        ];
        $langs = langs();
        foreach ($langs as $lang) {
            $categoryContent = CategoryContent::where([
                'category_id' => $category->id,
                'lang_id' => $lang->id
            ])->first();