app/Http/Controllers/FrontendController.php

select * from `articles` where `slug` in ('under-slider-articles', 'left-articles', 'right-articles', 'banners') and `status` = 1 and `articles`.`deleted_at` is null order by `order` asc limit 4
---
    public function index()
    {
        $underSliders = Article::byArticleSlug('under-slider-articles')
            ->homeArticles();
        $leftArticles = Article::byArticleSlug('left-articles')
            ->homeArticles();
        $rightArticles = Article::byArticleSlug('right-articles')
            ->homeArticles();
        $newsAndEvents =  Article::byArticleSlug('news-and-events')
            ->orderBy('order', 'ASC')
            ->take(4)
            ->active()
            ->orderBy('created_at', 'DESC')->paginate(6);