app/Http/Controllers/FrontendController.php

    public function articleDetail($slug)
    {
        $articleDetail = Article::with('category')
            ->bySlug($slug)
            ->active()
            ->firstOrFail();

        $relatedArticles = Article::with('category')
            ->byArticleSlug($articleDetail->category->slug ?? "")
            ->active()
            ->orderBy('created_at', 'DESC')
            ->whereNotIn('id', [$articleDetail->id ?? 0])
            ->paginate(12);

        $leftMenuCategory = Category::bySlug('structure-of-sambor-prei-kuk-national-authority')->firstOrFail();

        $leftMenus = Menu::byType('left-menu')
            ->orderBy('id', 'ASC')
            ->get();
---
select * from `categories` where `categories`.`id` in (1) and `categories`.`deleted_at` is null
select * from `categories` where `slug` = 'structure-of-sambor-prei-kuk-national-authority' and `categories`.`deleted_at` is null limit 1
select * from `menus` where `type` = 'left-menu' and `menus`.`deleted_at` is null order by `id` asc