app/Http/Controllers/MenuController.php

    public function edit(Menu $menu, MenuType $menuType)
    {

        $theMenu = [
            'category'      => $menu->category_id ?? "",
            'article'       => $menu->article_id ?? "",
            'is_active'     => $menu->status ? true : false,
            'parent'        => $menu->parent_id ?? "",
            'menuType'      => $menu->type ?? "",
            'order'         => $menu->order ?? 0
        ];

        $langs = langs();
        foreach ($langs as $lang) {
            $menuContent = MenuContent::where([
                'menu_id' => $menu->id,
                'lang_id' => $lang->id
            ])->first();
---
select * from `menu_contents` where (`menu_id` = 15 and `lang_id` = 2) limit 1

                            'menu_id' => $menu->id ?? null,
                            'lang_id' => $lang->id,
                        ];
                        MenuContent::updateOrcreate($mathThese, [
                            'menu_id' => $menu->id ?? null,
                            'lang_id' => $lang->id,
                            'name'    => $request->$name ?? "",
                            'description'   => $request->$description ?? ""
                        ]);
---
select * from `menu_contents` where (`menu_id` = 15 and `lang_id` = 2) limit 1

    public function getMenu($menuType)
    {
        $menus = Menu::orderBy('order', 'ASC')->byType($menuType)->parent()->get();
---
select * from `menus` where `type` = 'main-menu' and (`parent_id` is null or `parent_id` = 0) and `menus`.`deleted_at` is null order by `order` asc