app/Models/Article.php

select * from `article_contents` where `article_contents`.`article_id` = 78 and `article_contents`.`article_id` is not null limit 1
---
    function getDescriptionAttribute()
    {
        $content = $this->content ?? "";
        if ($content) {
            if ($content->desc !== "") {
                return $content->desc ?? "";
            }
        }
        $content = $this->hasOne(ArticleContent::class, 'article_id', 'id')->whereNotNull('desc')->first();