app/Models/Article.php

    public function content()
    {
        $locale = App::getLocale();

        $lang = Cache::rememberForever('language_' . $locale, function () use ($locale) {
            return Language::byLocale($locale)->firstOrFail();
        });

        return $this->hasOne(ArticleContent::class, 'article_id', 'id')
            ->where('lang_id', $lang->id);
---
select * from `languages` where `locale` = 'km' limit 1
select * from `article_contents` where `article_contents`.`article_id` = 78 and `article_contents`.`article_id` is not null and `lang_id` = 1 limit 1

    public function getNameAttribute()
    {
        if (!empty($this->content) && !empty($this->content->name)) {
            return $this->content->name;
        }

        $content = $this->hasOne(ArticleContent::class, 'article_id', 'id')
            ->whereNotNull('name')
            ->where('name', '<>', '')
            ->first();
---
select * from `article_contents` where `article_contents`.`article_id` = 78 and `article_contents`.`article_id` is not null and `name` is not null and `name` <> '' limit 1

    public function getDescriptionAttribute()
    {
        $content = $this->content;
        if (!empty($content) && !empty($content->desc)) {
            return $content->desc;
        }
        $content = ArticleContent::where('article_id', $this->id)
            ->whereNotNull('desc')
            ->where('desc', '<>', '')
            ->first();
---
select * from `article_contents` where `article_id` = 40 and `desc` is not null and `desc` <> '' limit 1

    public function scopeByArticleSlug($query, $slug)
    {
        $category = Category::bySlug($slug)->first();
---
select * from `categories` where `slug` = 'news-and-events' and `categories`.`deleted_at` is null limit 1