app/Models/Category.php

    function content()
    {
        $lang = Language::byLocale(App::getLocale())->first();
        return $this->hasOne(CategoryContent::class, 'category_id', 'id')->where('lang_id', $lang->id ?? null);
---
select * from `languages` where `locale` = 'km' limit 1
select * from `category_contents` where `category_contents`.`category_id` = 7 and `category_contents`.`category_id` is not null and `lang_id` = 1 limit 1

    function getNameAttribute()
    {
        $content = $this->content;
        $name = "";
        if ($content) {
            if ($content->name !== "") {
                return $content->name ?? "";
            }
        }
        $content = $this->hasOne(CategoryContent::class, 'category_id', 'id')
            ->whereNotNull('name')
            ->where('name', '<>', '')
            ->first();
---
select * from `category_contents` where `category_contents`.`category_id` = 4 and `category_contents`.`category_id` is not null and `name` is not null and `name` <> '' limit 1

    function getDescriptionAttribute()
    {
        $content = $this->content;
        if ($content) {
            if ($content->description !== "") {
                return $content->description ?? "";
            }
        }
        $content = $this->hasOne(CategoryContent::class, 'category_id', 'id')
            ->whereNotNull('description')
            ->where('description', '<>', '')
            ->first();
---
select * from `category_contents` where `category_contents`.`category_id` = 1 and `category_contents`.`category_id` is not null and `description` is not null and `description` <> '' limit 1