app/Models/Menu.php

select * from `languages` where `locale` = 'km' limit 1
select * from `menu_contents` where `menu_contents`.`menu_id` = 68 and `menu_contents`.`menu_id` is not null and `lang_id` = 1 limit 1
---
    function content()
    {
        $locale = App::getLocale();

        $lang = Cache::rememberForever('language_' . $locale, function () use ($locale) {
            return Language::byLocale($locale)->firstOrFail();
        });

        return $this->hasOne(MenuContent::class, 'menu_id', 'id')->where('lang_id', $lang->id ?? null);

select * from `menu_contents` where `menu_contents`.`menu_id` = 26 and `menu_contents`.`menu_id` is not null and `description` is not null and `description` <> '' limit 1
---
    function getDescriptionAttribute()
    {
        $content = $this->content;
        if ($content) {
            if ($content->description !== "") {
                return $content->description ?? "";
            }
        }
        $content = $this->hasOne(MenuContent::class, 'menu_id', 'id')
            ->whereNotNull('description')
            ->where('description', '<>', '')
            ->first();